app/assets/xml_templates/place_bid_or_purchase.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <PlaceBidOrPurchase xmlns="GdAuctionsBiddingWSAPI_v2">
      <domainName>DOMAIN_NAME</domainName>
      <sBidAmount>S_BID_AMOUNT</sBidAmount>
      <useMyPurchaseProfile>USE_MY_PURCHASE_PROFILE</useMyPurchaseProfile>
      <acceptUTOS>ACCEPT_UTOS</acceptUTOS>
      <acceptAMA>ACCEPT_AMA</acceptAMA>
      <acceptDNRA>ACCEPT_DNRA</acceptDNRA>
      <bidComment>BID_COMMENT</bidComment>
    </PlaceBidOrPurchase>
  </soap12:Body>
</soap12:Envelope>
